//Copyright 2025-Present riplin

#include <new>
#include <dos.h>
#include <limits.h>
#include <stdio.h>
#include <string.h>

#include <vector>
#include <string>

#include <dpmi.h>
#include <sys/nearptr.h>
#include <support/allocatr.h>
#include <hag/testing/mock.h>
#include <hag/testing/testpat.h>

#include <hag/system/bda.h>
#include <hag/system/pci.h>
#include <hag/system/pit.h>
#include <hag/drivers/vga/vga.h>
#include <hag/vesa/vidmodes.h>

#include <hag/drivers/vga/modeset.h>

#include <hag/system/keyboard.h>
#include <hag/drivers/vga/vga.h>
#include <support/dump.h>

#include <hag/drivers/3dfx/shared/crtc/ext0.h>
#include <hag/drivers/3dfx/shared/crtc/ext1.h>
#include <hag/drivers/3dfx/shared/crtc/ext2.h>
#include <hag/drivers/3dfx/shared/crtc/ext3.h>
#include <hag/drivers/3dfx/shared/crtc/horext.h>
#include <hag/drivers/3dfx/shared/crtc/verext.h>

#include <hag/drivers/3dfx/shared/io/dacmode.h>
#include <hag/drivers/3dfx/shared/io/drminit0.h>
#include <hag/drivers/3dfx/shared/io/drminit1.h>
#include <hag/drivers/3dfx/shared/io/vgainit0.h>
#include <hag/drivers/3dfx/shared/io/vgainit1.h>
#include <hag/drivers/3dfx/shared/io/viddostr.h>
#include <hag/drivers/3dfx/shared/io/viddsa.h>
#include <hag/drivers/3dfx/shared/io/vidprcfg.h>
#include <hag/drivers/3dfx/shared/io/vidscrs.h>
#include <hag/drivers/3dfx/shared/io/pllctrl0.h>
#include <hag/drivers/3dfx/shared/io/pllctrl1.h>
#include <hag/drivers/3dfx/shared/io/pllctrl2.h>

#include <hag/drivers/3dfx/shared/pci/fbbaddr.h>

        { 0x00, 0x01, 0x02, 0x03, 0x04, 0x05, 0x14, 0x07, 0x38, 0x39, 0x3A, 0x3B, 0x3C, 0x3D, 0x3E, 0x3F, 0x0C, 0x00, 0x0F, 0x00 },
        { 0x00, 0x00, 0x00, 0x00, 0x00, 0x10, 0x0E, 0x00, 0xFF }
    },
    {
        0x84,
        0x31,
        0x08,
        0x4000,
        { 0x01, 0x03, 0x00, 0x02 },
        0x6F,
        { 0x9E, 0x83, 0x84, 0x81, 0x8A, 0x9E, 0xBF, 0x1F, 0x00, 0x47, 0x06, 0x07, 0x00, 0x00, 0x00, 0x00, 0x9C, 0x8E, 0x8F, 0x42, 0x1F, 0x96, 0xB9, 0xA3, 0xFF },
        { 0x00, 0x01, 0x02, 0x03, 0x04, 0x05, 0x14, 0x07, 0x38, 0x39, 0x3A, 0x3B, 0x3C, 0x3D, 0x3E, 0x3F, 0x0C, 0x00, 0x0F, 0x00 },
        { 0x00, 0x00, 0x00, 0x00, 0x00, 0x10, 0x0E, 0x00, 0xFF }
    },
    {
        0x84,
        0x3B,
        0x08,
        0x4000,
        { 0x01, 0x03, 0x00, 0x02 },
        0xEF,
        { 0x9E, 0x83, 0x84, 0x81, 0x8A, 0x9E, 0x0B, 0x3E, 0x00, 0x47, 0x06, 0x07, 0x00, 0x00, 0x00, 0x00, 0xEA, 0x8C, 0xDF, 0x42, 0x1F, 0xE7, 0x04, 0xA3, 0xFF },
        { 0x00, 0x01, 0x02, 0x03, 0x04, 0x05, 0x14, 0x07, 0x38, 0x39, 0x3A, 0x3B, 0x3C, 0x3D, 0x3E, 0x3F, 0x0C, 0x00, 0x0F, 0x00 },
        { 0x00, 0x00, 0x00, 0x00, 0x00, 0x10, 0x0E, 0x00, 0xFF }
    },
    {
        0x28,
        0x18,
        0x08,
        0xFFFF,
        { 0x01, 0x0F, 0x00, 0x0E },
        0x6F,
        { 0x2D, 0x27, 0x28, 0x90, 0x29, 0x8F, 0xBF, 0x1F, 0x00, 0xC0, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x9C, 0x8E, 0x8F, 0x28, 0x1F, 0x96, 0xB9, 0xE3, 0xFF },
        { 0x00, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0A, 0x0B, 0x0C, 0x0D, 0x0E, 0x0F, 0x01, 0x00, 0x0F, 0x00 },
        { 0x00, 0x00, 0x00, 0x00, 0x00, 0x40, 0x05, 0x0F, 0xFF }
    },
    {
        0x28,
        0x1D,
        0x08,
        0xFFFF,
        { 0x01, 0x0F, 0x00, 0x0E },
        0xEF,
        { 0x2D, 0x27, 0x28, 0x90, 0x29, 0x8F, 0x0B, 0x3E, 0x00, 0xC0, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0xEA, 0x0C, 0xDF, 0x28, 0x1F, 0xE7, 0x04, 0xE3, 0xFF },
        { 0x00, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0A, 0x0B, 0x0C, 0x0D, 0x0E, 0x0F, 0x01, 0x00, 0x0F, 0x00 },
        { 0x00, 0x00, 0x00, 0x00, 0x00, 0x40, 0x05, 0x0F, 0xFF }
    },
    {
        0x32,
        0x24,
        0x08,
        0xFFFF,
        { 0x01, 0x0F, 0x00, 0x0E },
        0x2F,
        { 0x3D, 0x31, 0x32, 0x80, 0x35, 0x1D, 0x72, 0xF0, 0x00, 0x60, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x59, 0x0D, 0x57, 0x64, 0x00, 0x58, 0x73, 0xE3, 0xFF },
        { 0x00, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0A, 0x0B, 0x0C, 0x0D, 0x0E, 0x0F, 0x01, 0x00, 0x0F, 0x00 },
        { 0x00, 0x00, 0x00, 0x00, 0x00, 0x40, 0x05, 0x0F, 0xFF }
    },
    {
        0x40,
        0x1C,
        0x0E,
        0xFFFF,
        { 0x01, 0x0F, 0x00, 0x0E },
        0x2F,
        { 0x4F, 0x3F, 0x40, 0x83, 0x42, 0x0C, 0x24, 0xF5, 0x00, 0x60, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x03, 0x09, 0xFF, 0x80, 0x00, 0xFF, 0x25, 0xE3, 0xFF },
        { 0x00, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0A, 0x0B, 0x0C, 0x0D, 0x0E, 0x0F, 0x41, 0x00, 0x0F, 0x00 },
        { 0x00, 0x00, 0x00, 0x00, 0x00, 0x40, 0x05, 0x0F, 0xFF }
    }
};

struct ModeData
{
    Hag::VGA::VideoMode_t LegacyMode;//0x00 
    uint8_t OtherTableIndex;//0x01 Also used as index into the video param table if unknown3 is 0
    Hag::Vesa::VideoMode_t VesaMode;//0x02
    uint8_t Flags;//0x04 Also index for palette setting. Instead of flags, perhaps type?
    uint8_t Unknown1;//0x05
    uint8_t BitsPerPixel;//0x06
    uint16_t Width;//0x07 In pixels or chars
    uint16_t Height;//0x09 In pixels or chars
    uint16_t Stride;//0x0b Bytes per scan line
    uint8_t CharacterHeight;//0x0d
};

ModeData s_ModeData[] =
{
    //                           +----
    //                           | 0 =  0xb800, 32KB
    //                           | 1 =  0xb000, 32KB
    //                           | 2 =  0xb800, 32KB
    //                           | else 0xa000, 64KB
    //                           |
    //                           |
    //       Table               |        Bits    Width in    Height in
    //Legacy   0                 |         per     pixels      pixels     Bytes per  char
    // Mode  index VESA Mode     |        pixel   or chars    or chars    scan line height
    { 0x00,  0x17,  0x0000,    0x00, 0x08, 0x04,   0x0028,      0x0019,     0x0050,  0x10 },
    { 0x01,  0x17,  0x0001,    0x00, 0x08, 0x04,   0x0028,      0x0019,     0x0050,  0x10 },
    { 0x02,  0x18,  0x0002,    0x00, 0x08, 0x04,   0x0050,      0x0019,     0x00A0,  0x10 },
